# GetAllFilterableCategories Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterFilterUtilities..::..GetAllFilterableCategories Method
ParameterFilterUtilities Class See Also
---
Returns the set of categories that may be used in a ParameterFilterElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static ICollection<ElementId> GetAllFilterableCategories()
```

Visual Basic
---
```text
Public Shared Function GetAllFilterableCategories As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetAllFilterableCategories()
```

# ### Return Value
The set of all filterable categories.
# See Also
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace